nvme0n1_fio_results/dev-nvme0n1_2023-07-17_16:05/seq_w_nvme0n1_8iodepth/2048.txt
write: (g=0): rw=write, bs=(R) 2048KiB-2048KiB, (W) 2048KiB-2048KiB, (T) 2048KiB-2048KiB, ioengine=libaio, iodepth=8
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nvme0n1 failed: Permission denied

write: (groupid=0, jobs=1): err= 0: pid=6696: Mon Jul 17 16:25:50 2023
  write: IOPS=1220, BW=2441MiB/s (2560MB/s)(47.7GiB/20005msec)
    slat (usec): min=57, max=579, avg=127.66, stdev=36.88
    clat (usec): min=836, max=21844, avg=6423.95, stdev=1967.32
     lat (usec): min=969, max=21935, avg=6551.89, stdev=1966.04
    clat percentiles (usec):
     |  1.00th=[ 2376],  5.00th=[ 3523], 10.00th=[ 4621], 20.00th=[ 5800],
     | 30.00th=[ 5997], 40.00th=[ 6128], 50.00th=[ 6259], 60.00th=[ 6390],
     | 70.00th=[ 6521], 80.00th=[ 6652], 90.00th=[ 7701], 95.00th=[10552],
     | 99.00th=[14484], 99.50th=[15533], 99.90th=[17957], 99.95th=[18482],
     | 99.99th=[21627]
   bw (  MiB/s): min= 2368, max= 2524, per=99.99%, avg=2440.88, stdev=39.40, samples=40
   iops        : min= 1184, max= 1262, avg=1220.42, stdev=19.71, samples=40
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.07%, 4=7.38%, 10=86.65%, 20=5.87%, 50=0.03%
  cpu          : usr=8.35%, sys=8.68%, ctx=23704, majf=0, minf=1588
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,24418,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=2441MiB/s (2560MB/s), 2441MiB/s-2441MiB/s (2560MB/s-2560MB/s), io=47.7GiB (51.2GB), run=20005-20005msec

Disk stats (read/write):
  nvme0n1: ios=43/388461, merge=0/0, ticks=2/2166716, in_queue=2149131, util=99.62%