nvme0n1_fio_results/dev-nvme0n1_2023-07-17_16:05/seq_w_nvme0n1_8iodepth/8192.txt
write: (g=0): rw=write, bs=(R) 8192KiB-8192KiB, (W) 8192KiB-8192KiB, (T) 8192KiB-8192KiB, ioengine=libaio, iodepth=8
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nvme0n1 failed: Permission denied

write: (groupid=0, jobs=1): err= 0: pid=6795: Mon Jul 17 16:26:31 2023
  write: IOPS=305, BW=2444MiB/s (2563MB/s)(47.8GiB/20023msec)
    slat (usec): min=338, max=1034, avg=697.69, stdev=107.50
    clat (usec): min=4033, max=43156, avg=25475.80, stdev=2649.04
     lat (usec): min=4387, max=43884, avg=26173.72, stdev=2644.93
    clat percentiles (usec):
     |  1.00th=[19530],  5.00th=[21890], 10.00th=[23462], 20.00th=[23987],
     | 30.00th=[24511], 40.00th=[24773], 50.00th=[25035], 60.00th=[25297],
     | 70.00th=[25822], 80.00th=[26870], 90.00th=[28967], 95.00th=[30802],
     | 99.00th=[33817], 99.50th=[34866], 99.90th=[36439], 99.95th=[38011],
     | 99.99th=[43254]
   bw (  MiB/s): min= 2368, max= 2512, per=99.98%, avg=2443.88, stdev=37.85, samples=40
   iops        : min=  296, max=  314, avg=305.47, stdev= 4.72, samples=40
  lat (msec)   : 10=0.08%, 20=1.80%, 50=98.12%
  cpu          : usr=16.33%, sys=5.26%, ctx=6092, majf=0, minf=177
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,6118,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=2444MiB/s (2563MB/s), 2444MiB/s-2444MiB/s (2563MB/s-2563MB/s), io=47.8GiB (51.3GB), run=20023-20023msec

Disk stats (read/write):
  nvme0n1: ios=43/388371, merge=0/0, ticks=2/9276368, in_queue=9261789, util=99.44%